src/test/resources/jmeter/business/rules/R08740NonProtectingParentCode.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.3 r1808647">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">${__P(protocol,https)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ASSERTION_LOGS_FILE" elementType="Argument">
            <stringProp name="Argument.name">ASSERTION_LOGS_FILE</stringProp>
            <stringProp name="Argument.value">/Users/tparker/projects/API/logs/failed.log</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JDBC USERS" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(api.users)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1482864233000</longProp>
        <longProp name="ThreadGroup.end_time">1482864233000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <IncludeController guiclass="IncludeControllerGui" testclass="IncludeController" testname="Include Controller" enabled="true">
          <stringProp name="IncludeController.includepath">../../login.jmx</stringProp>
        </IncludeController>
        <hashTree/>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Create Controller" enabled="true"/>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST_CASE_1" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
   &quot;approval_status&quot;:118,&#xd;
   &quot;family_awareness&quot;:true,&#xd;
   &quot;filed_with_law_enforcement&quot;:false,&#xd;
   &quot;additional_information&quot;:null,&#xd;
   &quot;allegations&quot;:[&#xd;
      {&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;victim_person_id&quot;:&quot;6&quot;,&#xd;
         &quot;perpetrator_person_id&quot;:&quot;7&quot;,&#xd;
         &quot;type&quot;:2177,&#xd;
         &quot;county&quot;:&quot;57&quot;,&#xd;
         &quot;non_protecting_parent&quot;:&quot;U&quot;&#xd;
      },&#xd;
      {&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;victim_person_id&quot;:&quot;6&quot;,&#xd;
         &quot;perpetrator_person_id&quot;:&quot;7&quot;,&#xd;
         &quot;type&quot;:2178,&#xd;
         &quot;county&quot;:&quot;57&quot;,&#xd;
         &quot;non_protecting_parent&quot;:&quot;U&quot;&#xd;
      }&#xd;
   ],&#xd;
   &quot;assignee&quot;:&quot;Jim Bob&quot;,&#xd;
   &quot;communication_method&quot;:5375,&#xd;
   &quot;cross_reports&quot;:[&#xd;
      {&#xd;
         &quot;id&quot;:&quot;20&quot;,&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;inform_date&quot;:&quot;2016-08-17&quot;,&#xd;
         &quot;method&quot;:2096,&#xd;
         &quot;filed_out_of_state&quot;:true,&#xd;
         &quot;county_id&quot;:&quot;1126&quot;,&#xd;
          &quot;agencies&quot;:[]&#xd;
      },&#xd;
      {&#xd;
         &quot;id&quot;:&quot;21&quot;,&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;inform_date&quot;:&quot;2016-08-17&quot;,&#xd;
         &quot;method&quot;:2096,&#xd;
         &quot;filed_out_of_state&quot;:true,&#xd;
         &quot;county_id&quot;:&quot;1126&quot;,&#xd;
          &quot;agencies&quot;:[]&#xd;
      }&#xd;
   ],&#xd;
   &quot;ended_at&quot;:null,&#xd;
   &quot;id&quot;:&quot;9&quot;,&#xd;
   &quot;incident_county&quot;:&quot;36&quot;,&#xd;
   &quot;incident_date&quot;:&quot;1996-08-23&quot;,&#xd;
   &quot;location_type&quot;:&quot;Child&apos;s Home&quot;,&#xd;
   &quot;name&quot;:&quot;Languages test&quot;,&#xd;
   &quot;reference&quot;:&quot;XLT60X&quot;,&#xd;
   &quot;report_narrative&quot;:&quot;Distinctio ad aliquid ut doloremque nobis. &quot;,&#xd;
   &quot;screening_decision&quot;:&quot;promote_to_referral&quot;,&#xd;
   &quot;screening_decision_detail&quot;:&quot;3_days&quot;,&#xd;
   &quot;started_at&quot;:&quot;2017-08-02T18:55:00.000Z&quot;,&#xd;
   &quot;assignee_staff_id&quot;:&quot;con&quot;,&#xd;
   &quot;legacy_id&quot;:null,&#xd;
   &quot;legacy_source_table&quot;:null,&#xd;
   &quot;response_time&quot;:1516,&#xd;
   &quot;responsible_agency&quot;:&quot;C&quot;,&#xd;
   &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
   &quot;limited_access_description&quot;: &quot;&quot;,&#xd;
   &quot;limited_access_agency&quot;:&quot;&quot;,&#xd;
   &quot;limited_access_date&quot;:&quot;&quot;,&#xd;
   &quot;address&quot;:{&#xd;
      &quot;legacy_id&quot;:null,&#xd;
      &quot;legacy_source_table&quot;:null,&#xd;
      &quot;city&quot;:&quot;Wilheminachester&quot;,&#xd;
      &quot;state&quot;:1838,&#xd;
      &quot;street_address&quot;:&quot;005 Lorenzo Hills&quot;,&#xd;
      &quot;zip&quot;:&quot;55926&quot;,&#xd;
      &quot;type&quot;:6272&#xd;
   },&#xd;
   &quot;participants&quot;:[&#xd;
      {&#xd;
         &quot;id&quot;:&quot;8&quot;,&#xd;
         &quot;legacy_descriptor&quot;:{&#xd;
            &quot;legacy_id&quot;:null,&#xd;
            &quot;legacy_ui_id&quot;:null,&#xd;
            &quot;legacy_last_updated&quot;:null,&#xd;
            &quot;legacy_table_name&quot;:null,&#xd;
            &quot;legacy_table_description&quot;:null&#xd;
         },&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;gender&quot;:&quot;m&quot;,&#xd;
         &quot;first_name&quot;:&quot;Lavette&quot;,&#xd;
         &quot;last_name&quot;:&quot;Konopelski&quot;,&#xd;
         &quot;middle_name&quot;:&quot;N&quot;,&#xd;
         &quot;name_suffix&quot;:null,&#xd;
         &quot;roles&quot;:[&#xd;
            &quot;Mandated Reporter&quot;&#xd;
         ],&#xd;
         &quot;screening_id&quot;:&quot;9&quot;,&#xd;
         &quot;date_of_birth&quot;:&quot;1980-03-28&quot;,&#xd;
         &quot;ssn&quot;:&quot;373201577&quot;,&#xd;
         &quot;primary_language&quot;:1249,&#xd;
         &quot;secondary_language&quot;:null,&#xd;
         &quot;client_staff_person_added&quot;:false,&#xd;
         &quot;reporter_confidential_waiver&quot;:true,&#xd;
         &quot;reporter_employer_name&quot;:&quot;&quot;,&#xd;
         &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
         &quot;race_ethnicity&quot;:{  &#xd;
           &quot;race_codes&quot;:[],&#xd;
           &quot;unable_to_determine_code&quot;:&quot;A&quot;,&#xd;
           &quot;hispanic_codes&quot;:[],&#xd;
           &quot;hispanic_orgin_code&quot;:&quot;X&quot;,&#xd;
           &quot;hispanic_unable_to_determine_code&quot;:&quot;A&quot;&#xd;
         },&#xd;
         &quot;addresses&quot;:[&#xd;
            {&#xd;
               &quot;legacy_id&quot;:null,&#xd;
               &quot;legacy_source_table&quot;:null,&#xd;
               &quot;city&quot;:&quot;Quintinberg&quot;,&#xd;
               &quot;state&quot;:1844,&#xd;
               &quot;street_address&quot;:&quot;8211 Stephen Bridge&quot;,&#xd;
               &quot;zip&quot;:&quot;71146&quot;,&#xd;
               &quot;type&quot;:6273&#xd;
            }&#xd;
         ]&#xd;
      },&#xd;
      {&#xd;
         &quot;id&quot;:&quot;7&quot;,&#xd;
         &quot;legacy_descriptor&quot;:{&#xd;
            &quot;legacy_id&quot;:null,&#xd;
            &quot;legacy_ui_id&quot;:null,&#xd;
            &quot;legacy_last_updated&quot;:null,&#xd;
            &quot;legacy_table_name&quot;:null,&#xd;
            &quot;legacy_table_description&quot;:null&#xd;
         },&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;gender&quot;:&quot;M&quot;,&#xd;
         &quot;first_name&quot;:&quot;Abdul&quot;,&#xd;
         &quot;last_name&quot;:&quot;Ziemessasdfsadf&quot;,&#xd;
         &quot;middle_name&quot;:&quot;R&quot;,&#xd;
         &quot;name_suffix&quot;:null,&#xd;
         &quot;roles&quot;:[&#xd;
            &quot;Perpetrator&quot;&#xd;
         ],&#xd;
         &quot;screening_id&quot;:&quot;9&quot;,&#xd;
         &quot;date_of_birth&quot;:&quot;1995-10-23&quot;,&#xd;
         &quot;ssn&quot;:&quot;442743442&quot;,&#xd;
         &quot;primary_language&quot;:null,&#xd;
         &quot;secondary_language&quot;:null,&#xd;
         &quot;client_staff_person_added&quot;:false,&#xd;
         &quot;reporter_confidential_waiver&quot;:true,&#xd;
         &quot;reporter_employer_name&quot;:&quot;&quot;,&#xd;
         &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
         &quot;race_ethnicity&quot;:{  &#xd;
           &quot;race_codes&quot;:[],&#xd;
           &quot;unable_to_determine_code&quot;:&quot;A&quot;,&#xd;
           &quot;hispanic_codes&quot;:[],&#xd;
           &quot;hispanic_orgin_code&quot;:&quot;X&quot;,&#xd;
           &quot;hispanic_unable_to_determine_code&quot;:&quot;A&quot;&#xd;
         },&#xd;
         &quot;addresses&quot;:[]&#xd;
      },&#xd;
      {&#xd;
         &quot;id&quot;:&quot;6&quot;,&#xd;
         &quot;legacy_descriptor&quot;:{&#xd;
            &quot;legacy_id&quot;:null,&#xd;
            &quot;legacy_ui_id&quot;:null,&#xd;
            &quot;legacy_last_updated&quot;:&quot;2017-08-04T21:02:38.598+0000&quot;,&#xd;
            &quot;legacy_table_name&quot;:null,&#xd;
            &quot;legacy_table_description&quot;:null&#xd;
         },&#xd;
         &quot;legacy_id&quot;:&quot;&quot;,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;gender&quot;:&quot;U&quot;,&#xd;
         &quot;first_name&quot;:&quot;See&quot;,&#xd;
         &quot;last_name&quot;:&quot;Abbott&quot;,&#xd;
         &quot;middle_name&quot;:&quot;K&quot;,&#xd;
         &quot;name_suffix&quot;:null,&#xd;
         &quot;roles&quot;:[&#xd;
            &quot;Victim&quot;&#xd;
         ],&#xd;
         &quot;screening_id&quot;:&quot;9&quot;,&#xd;
         &quot;date_of_birth&quot;:&quot;2005-08-14&quot;,&#xd;
         &quot;ssn&quot;:&quot;546486409&quot;,&#xd;
         &quot;primary_language&quot;:null,&#xd;
         &quot;secondary_language&quot;:null,&#xd;
         &quot;client_staff_person_added&quot;:false,&#xd;
         &quot;reporter_confidential_waiver&quot;:true,&#xd;
         &quot;reporter_employer_name&quot;:&quot;&quot;,&#xd;
         &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
         &quot;race_ethnicity&quot;:{  &#xd;
           &quot;race_codes&quot;:[],&#xd;
           &quot;unable_to_determine_code&quot;:&quot;A&quot;,&#xd;
           &quot;hispanic_codes&quot;:[],&#xd;
           &quot;hispanic_orgin_code&quot;:&quot;X&quot;,&#xd;
           &quot;hispanic_unable_to_determine_code&quot;:&quot;A&quot;&#xd;
         },&#xd;
         &quot;addresses&quot;:[]&#xd;
      }&#xd;
   ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(api.host)}</stringProp>
            <stringProp name="HTTPSampler.protocol">${__P(api.protocol)}</stringProp>
            <stringProp name="HTTPSampler.path">/referrals?token=${__property(token)}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49587">201</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="-250877776">&quot;non_protecting_parent&quot; : &quot;N&quot;</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST_CASE_2" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
   &quot;approval_status&quot;:118,&#xd;
   &quot;family_awareness&quot;:true,&#xd;
   &quot;filed_with_law_enforcement&quot;:false,&#xd;
   &quot;additional_information&quot;:null,&#xd;
   &quot;allegations&quot;:[&#xd;
      {&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;victim_person_id&quot;:&quot;6&quot;,&#xd;
         &quot;perpetrator_person_id&quot;:&quot;&quot;,&#xd;
         &quot;type&quot;:2177,&#xd;
         &quot;county&quot;:&quot;56&quot;,&#xd;
         &quot;non_protecting_parent&quot;:&quot;U&quot;&#xd;
      &#xd;
      }&#xd;
   ],&#xd;
   &quot;assignee&quot;:&quot;Jim Bob&quot;,&#xd;
   &quot;communication_method&quot;:5375,&#xd;
   &quot;cross_reports&quot;:[&#xd;
      {&#xd;
         &quot;id&quot;:&quot;20&quot;,&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;inform_date&quot;:&quot;2016-08-17&quot;,&#xd;
         &quot;method&quot;:2096,&#xd;
         &quot;filed_out_of_state&quot;:true,&#xd;
         &quot;county_id&quot;:&quot;1126&quot;,&#xd;
          &quot;agencies&quot;:[]&#xd;
      },&#xd;
      {&#xd;
         &quot;id&quot;:&quot;21&quot;,&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;inform_date&quot;:&quot;2016-08-17&quot;,&#xd;
         &quot;method&quot;:2096,&#xd;
         &quot;filed_out_of_state&quot;:true,&#xd;
         &quot;county_id&quot;:&quot;1126&quot;,&#xd;
          &quot;agencies&quot;:[]&#xd;
      }&#xd;
   ],&#xd;
   &quot;ended_at&quot;:null,&#xd;
   &quot;id&quot;:&quot;9&quot;,&#xd;
   &quot;incident_county&quot;:&quot;36&quot;,&#xd;
   &quot;incident_date&quot;:&quot;1996-08-23&quot;,&#xd;
   &quot;location_type&quot;:&quot;Child&apos;s Home&quot;,&#xd;
   &quot;name&quot;:&quot;Languages test&quot;,&#xd;
   &quot;reference&quot;:&quot;XLT60X&quot;,&#xd;
   &quot;report_narrative&quot;:&quot;Distinctio ad aliquid ut doloremque nobis. &quot;,&#xd;
   &quot;screening_decision&quot;:&quot;promote_to_referral&quot;,&#xd;
   &quot;screening_decision_detail&quot;:&quot;3_days&quot;,&#xd;
   &quot;started_at&quot;:&quot;2017-08-02T18:55:00.000Z&quot;,&#xd;
   &quot;assignee_staff_id&quot;:&quot;con&quot;,&#xd;
   &quot;legacy_id&quot;:null,&#xd;
   &quot;legacy_source_table&quot;:null,&#xd;
   &quot;response_time&quot;:1516,&#xd;
   &quot;responsible_agency&quot;:&quot;C&quot;,&#xd;
   &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
   &quot;limited_access_description&quot;: &quot;&quot;,&#xd;
   &quot;limited_access_agency&quot;:&quot;&quot;,&#xd;
   &quot;limited_access_date&quot;:&quot;&quot;,&#xd;
   &quot;address&quot;:{&#xd;
      &quot;legacy_id&quot;:null,&#xd;
      &quot;legacy_source_table&quot;:null,&#xd;
      &quot;city&quot;:&quot;Wilheminachester&quot;,&#xd;
      &quot;state&quot;:1838,&#xd;
      &quot;street_address&quot;:&quot;005 Lorenzo Hills&quot;,&#xd;
      &quot;zip&quot;:&quot;55926&quot;,&#xd;
      &quot;type&quot;:6272&#xd;
   },&#xd;
   &quot;participants&quot;:[&#xd;
      {&#xd;
         &quot;id&quot;:&quot;8&quot;,&#xd;
         &quot;legacy_descriptor&quot;:{&#xd;
            &quot;legacy_id&quot;:null,&#xd;
            &quot;legacy_ui_id&quot;:null,&#xd;
            &quot;legacy_last_updated&quot;:null,&#xd;
            &quot;legacy_table_name&quot;:null,&#xd;
            &quot;legacy_table_description&quot;:null&#xd;
         },&#xd;
         &quot;legacy_id&quot;:null,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;gender&quot;:&quot;m&quot;,&#xd;
         &quot;first_name&quot;:&quot;Lavette&quot;,&#xd;
         &quot;last_name&quot;:&quot;Konopelski&quot;,&#xd;
         &quot;middle_name&quot;:&quot;N&quot;,&#xd;
         &quot;name_suffix&quot;:null,&#xd;
         &quot;roles&quot;:[&#xd;
            &quot;Mandated Reporter&quot;&#xd;
         ],&#xd;
         &quot;screening_id&quot;:&quot;9&quot;,&#xd;
         &quot;date_of_birth&quot;:&quot;1980-03-28&quot;,&#xd;
         &quot;ssn&quot;:&quot;373201577&quot;,&#xd;
         &quot;primary_language&quot;:1249,&#xd;
         &quot;secondary_language&quot;:null,&#xd;
         &quot;client_staff_person_added&quot;:false,&#xd;
         &quot;reporter_confidential_waiver&quot;:true,&#xd;
         &quot;reporter_employer_name&quot;:&quot;&quot;,&#xd;
         &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
         &quot;race_ethnicity&quot;:{  &#xd;
           &quot;race_codes&quot;:[],&#xd;
           &quot;unable_to_determine_code&quot;:&quot;A&quot;,&#xd;
           &quot;hispanic_codes&quot;:[],&#xd;
           &quot;hispanic_orgin_code&quot;:&quot;X&quot;,&#xd;
           &quot;hispanic_unable_to_determine_code&quot;:&quot;A&quot;&#xd;
         },&#xd;
         &quot;addresses&quot;:[&#xd;
            {&#xd;
               &quot;legacy_id&quot;:null,&#xd;
               &quot;legacy_source_table&quot;:null,&#xd;
               &quot;city&quot;:&quot;Quintinberg&quot;,&#xd;
               &quot;state&quot;:1844,&#xd;
               &quot;street_address&quot;:&quot;8211 Stephen Bridge&quot;,&#xd;
               &quot;zip&quot;:&quot;71146&quot;,&#xd;
               &quot;type&quot;:6273&#xd;
            }&#xd;
         ]&#xd;
      },&#xd;
      {&#xd;
         &quot;id&quot;:&quot;6&quot;,&#xd;
         &quot;legacy_descriptor&quot;:{&#xd;
            &quot;legacy_id&quot;:null,&#xd;
            &quot;legacy_ui_id&quot;:null,&#xd;
            &quot;legacy_last_updated&quot;:&quot;2017-08-04T21:02:38.598+0000&quot;,&#xd;
            &quot;legacy_table_name&quot;:null,&#xd;
            &quot;legacy_table_description&quot;:null&#xd;
         },&#xd;
         &quot;legacy_id&quot;:&quot;&quot;,&#xd;
         &quot;legacy_source_table&quot;:null,&#xd;
         &quot;gender&quot;:&quot;U&quot;,&#xd;
         &quot;first_name&quot;:&quot;See&quot;,&#xd;
         &quot;last_name&quot;:&quot;Abbott&quot;,&#xd;
         &quot;middle_name&quot;:&quot;K&quot;,&#xd;
         &quot;name_suffix&quot;:null,&#xd;
         &quot;roles&quot;:[&#xd;
            &quot;Victim&quot;&#xd;
         ],&#xd;
         &quot;screening_id&quot;:&quot;9&quot;,&#xd;
         &quot;date_of_birth&quot;:&quot;2005-08-14&quot;,&#xd;
         &quot;ssn&quot;:&quot;546486409&quot;,&#xd;
         &quot;primary_language&quot;:null,&#xd;
         &quot;secondary_language&quot;:null,&#xd;
         &quot;client_staff_person_added&quot;:false,&#xd;
         &quot;reporter_confidential_waiver&quot;:true,&#xd;
         &quot;reporter_employer_name&quot;:&quot;&quot;,&#xd;
         &quot;limited_access_code&quot;: &quot;N&quot;,&#xd;
         &quot;race_ethnicity&quot;:{  &#xd;
           &quot;race_codes&quot;:[],&#xd;
           &quot;unable_to_determine_code&quot;:&quot;A&quot;,&#xd;
           &quot;hispanic_codes&quot;:[],&#xd;
           &quot;hispanic_orgin_code&quot;:&quot;X&quot;,&#xd;
           &quot;hispanic_unable_to_determine_code&quot;:&quot;A&quot;&#xd;
         },&#xd;
         &quot;addresses&quot;:[]&#xd;
      }&#xd;
   ]&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${__P(api.host)}</stringProp>
            <stringProp name="HTTPSampler.protocol">${__P(api.protocol)}</stringProp>
            <stringProp name="HTTPSampler.path">/referrals?token=${__property(token)}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49587">201</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="-250877559">&quot;non_protecting_parent&quot; : &quot;U&quot;</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
            <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
              <boolProp name="ResultCollector.error_logging">false</boolProp>
            </ResultCollector>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="AssertionVisualizer" testclass="ResultCollector" testname="Assertion Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
          <stringProp name="filename">${__P(logs.assertion.file)}</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>